       program-id. pgm1 as "pgm1".

       environment division.
       configuration section.

       data division.
       working-storage section.

       procedure division.


           goback.

       end program pgm1.
