//CREFICW   JOB (ACCOUNT),GIE,MSGCLASS=X,CLASS=A,NOTIFY=&SYSUID
//ETAPE EXEC PGM=IKJEFT01
//STEPLIB  DD DSN=DSN910.DB9G.RUNLIB.LOAD,DISP=SHR
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSTSIN DD *
  DSN SYSTEM(DB9G)
    BIND PLAN(PLANCOB) PKLIST(COL1.*) -
    OWNER(IBMUSER)
    END
