//BINDPAK   JOB (ACCOUNT),GIE,MSGCLASS=X,CLASS=A,NOTIFY=&SYSUID
//ETAPE EXEC PGM=IKJEFT01
//STEPLIB  DD DSN=DSN910.DB9G.RUNLIB.LOAD,DISP=SHR
//DBRMLIB  DD DSN=IBMUSER.COB.DBRM,DISP=SHR
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSTSIN DD *
  DSN SYSTEM(DB9G)
    BIND PACKAGE(COL1) MEMBER(MACPT) -
    OWNER(IBMUSER) QUALIFIER(IBMUSER) -
    ACTION(REPLACE) VALIDATE(BIND) ISOLATION(CS) ENCODING(EBCDIC)
    END
