//SQLDATAB  JOB (ACCOUNT),GIE,MSGCLASS=X,CLASS=A,NOTIFY=&SYSUID
//ETAPE  EXEC PGM=IKJEFT01
//STEPLIB  DD DSN=DSN910.DB9G.RUNLIB.LOAD,DISP=SHR
//         DD DSN=IBMUSER.COB.LOAD,DISP=SHR
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSTSIN  DD *
     DSN SYSTEM(DB9G)
     RUN PROGRAM(MFMAJCPT) PLAN (PLANCOB)
     END
