//IBMUSERD  JOB (ACCOUNT),GIE,MSGCLASS=X,CLASS=A,NOTIFY=&SYSUID         JOB06103
//*
//PH06OS02 EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT)
//SYSTSPRT DD  SYSOUT=*
//STEPLIB  DD  DSN=DSN910.DB9G.RUNLIB.LOAD,DISP=SHR
//SYSPRINT DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=*
//SYSTSIN  DD  *
DELETE 'IBMUSER.COB.DCLGEN(DCCPT)'
DELETE 'IBMUSER.COB.DCLGEN(DCHIS)'
DELETE 'IBMUSER.COB.DCLGEN(DCDEV)'
DELETE 'IBMUSER.COB.DCLGEN(DCOPE)'
  DSN SYSTEM(DB9G)
  DCLGEN TABLE(IBMUSER.TBCPT)                 -
        LIBRARY('IBMUSER.COB.DCLGEN(DCCPT)') -
        ACTION(ADD) -
        LANGUAGE(COBOL) -
        NAMES(HC-) -
        COLSUFFIX(YES)
  DCLGEN TABLE(IBMUSER.TBHIS)                -
        LIBRARY('IBMUSER.COB.DCLGEN(DCHIS)') -
        ACTION(ADD) -
        LANGUAGE(COBOL) -
        NAMES(HH-) -
        COLSUFFIX(YES)
  DCLGEN TABLE(IBMUSER.TBDEV)                -
        LIBRARY('IBMUSER.COB.DCLGEN(DCDEV)') -
        ACTION(ADD) -
        LANGUAGE(COBOL) -
        NAMES(HD-) -
        COLSUFFIX(YES)
  DCLGEN TABLE(IBMUSER.TBOPE)                -
        LIBRARY('IBMUSER.COB.DCLGEN(DCOPE)') -
        ACTION(ADD) -
        LANGUAGE(COBOL) -
        NAMES(HO-) -
        COLSUFFIX(YES)
