       01 ZF-MAJCPT.
         05 ZF-COMPTE PIC  X(11).
         05 ZF-REFOPE PIC  X(03).
         05 ZF-CODOPE PIC X(03).
         05 ZF-DATOPE PIC X(10).
         05 ZF-MNTOPE PIC S9(11)V99 COMP-3.
         05 ZF-CODDEV.
         
       01 ZF-RETOUR.
         05 ZF-CODRET  PIC X(02).
         05 ZF-SQLCODE PIC S9(3).
         05 ZF-LIBRET  PIC X(30).
            

            